ftp/orgs/backlog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-12-31 Thu 21:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Haisheng Wu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline4">1. Articles</a>
<ul>
<li><a href="#orgheadline3">1.1. <span class="todo nilTODO">TODO</span> category-theory-for-programmers-the-preface</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Questions</a></li>
<li><a href="#orgheadline2">1.1.2. Interesting quotes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline9">2. OnlineCourse</a>
<ul>
<li><a href="#orgheadline5">2.1. <span class="todo nilTODO">TODO</span> Coursea - Computing for Data Analysis</a></li>
<li><a href="#orgheadline6">2.2. <span class="todo nilTODO">TODO</span> Udacity - Interactive 3D Graphics</a></li>
<li><a href="#orgheadline7">2.3. <span class="todo nilTODO">TODO</span> Udacity - Design of Computer Programs</a></li>
<li><a href="#orgheadline8">2.4. <span class="todo nilTODO">TODO</span> Udacity - Intro to Artificial Intelligence</a></li>
</ul>
</li>
<li><a href="#orgheadline16">3. Books</a>
<ul>
<li><a href="#orgheadline10">3.1. <span class="todo nilTODO">TODO</span> Beatiful Code</a></li>
<li><a href="#orgheadline11">3.2. <span class="todo nilTODO">TODO</span> Introduce to Algorithm</a></li>
<li><a href="#orgheadline12">3.3. <span class="todo nilTODO">TODO</span> Agile Software Development, Principles, Patterns, and Practices</a></li>
<li><a href="#orgheadline13">3.4. <span class="todo nilTODO">TODO</span> Programming Pearls 1,2</a></li>
<li><a href="#orgheadline14">3.5. <span class="todo nilTODO">TODO</span> Silicon Valley History</a></li>
<li><a href="#orgheadline15">3.6. <span class="todo nilTODO">TODO</span> The essences of classical music</a></li>
</ul>
</li>
<li><a href="#orgheadline19">4. Videos</a>
<ul>
<li><a href="#orgheadline17">4.1. <span class="todo nilTODO">TODO</span> mit - Gödel, Escher, Bach</a></li>
<li><a href="#orgheadline18">4.2. <span class="todo nilTODO">TODO</span> mit - Mathematics for Computer Science</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">1</span> Articles</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> <a href="http://bartoszmilewski.com/2014/10/28/category-theory-for-programmers-the-preface/">category-theory-for-programmers-the-preface</a></h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Questions</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>How to understand "Haskell types are sets and functions are
math function"?
<ul class="org-ul">
<li>Object has 0 type Void</li>
<li>Object has 1 type unit/()</li>
<li>Object has 2 types True | False, type Boolean</li>
<li>Monoid category only has one Object</li>
</ul></li>

<li>isomorphisim</li>

<li>Keleis Category</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> Interesting quotes</h4>
<div class="outline-text-4" id="text-1-1-2">
<blockquote>
<p>
In the ideal world we would just say that Haskell types are sets and
Haskell functions are mathematical functions between sets.
</p>
</blockquote>

<blockquote>
<p>
That means we do reason about programs we write, and we usually do it
by running an interpreter in our heads. It’s just really hard to keep
track of all the variables. Computers are good at running programs —
humans are not! If we were, we wouldn’t need computers.
</p>
</blockquote>

<blockquote>
<p>
For our limited purposes, a Kleisli category has, as objects, the
types of the underlying programming language. Morphisms from type A to
type B are functions that go from A to a type derived from B using the
particular embellishment. Each Kleisli category defines its own way of
composing such morphisms, as well as the identity morphisms with
respect to that composition.
</p>
</blockquote>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">2</span> OnlineCourse</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> <a href="https://www.coursera.org/course/compdata">Coursea - Computing for Data Analysis</a></h3>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> <a href="https://www.udacity.com/course/interactive-3d-graphics--cs291">Udacity - Interactive 3D Graphics</a></h3>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> <a href="https://www.udacity.com/course/cs212">Udacity - Design of Computer Programs</a></h3>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> <a href="https://www.udacity.com/course/cs271">Udacity - Intro to Artificial Intelligence</a></h3>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">3</span> Books</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> Beatiful Code</h3>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> Introduce to Algorithm</h3>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> Agile Software Development, Principles, Patterns, and Practices</h3>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.4</span> <span class="todo TODO">TODO</span> Programming Pearls 1,2</h3>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.5</span> <span class="todo TODO">TODO</span> <a href="http://patrickcollison.com/svhistory">Silicon Valley History</a></h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Geek Silicon Valley, by Ashlee Van Vance</li>
<li>Revolution in The Valley: The Insanely Great Story of How the Mac Was Made, by Andy Hertzfeld</li>
<li>Making Silicon Valley: Innovation and the Growth of High Tech , Christophe Lécuyer</li>
<li>The Chip: How Two Americans Invented the Microchip and Launched a Revolution, T.R. Reid</li>
<li>Dealers of Lightning, Michael A. Hiltzik</li>
<li>The Idea Factory: Bell Labs and the Great Age of American Innovation, Jon Gertner</li>
<li>Computer Lib/Dream Machines Paperback, Theodor H. Nelson</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.6</span> <span class="todo TODO">TODO</span> The essences of classical music</h3>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">4</span> Videos</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> mit - Gödel, Escher, Bach</h3>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> mit - Mathematics for Computer Science</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Haisheng Wu</p>
<p class="date">Created: 2015-12-31 Thu 21:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
